{"class_name": "Sequential", "keras_version": "1.1.0", "config": [{"class_name": "Dense", "config": {"kernel_constraint": null, "bias_constraint": null, "name": "dense_1", "units": 512, "activity_regularizer": null, "trainable": true, "kernel_initializer": "glorot_normal", "use_bias": true, "dtype": "float32", "input_dim": 4096, "bias_regularizer": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "activation": "relu", "batch_input_shape": [null, 4096]}}, {"class_name": "Dropout", "config": {"rate": 0.6, "trainable": true, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "bias_constraint": null, "name": "dense_2", "activity_regularizer": null, "trainable": true, "kernel_initializer": "glorot_normal", "use_bias": true, "input_dim": null, "bias_regularizer": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "activation": "linear", "units": 32}}, {"class_name": "Dropout", "config": {"rate": 0.6, "trainable": true, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "bias_constraint": null, "name": "dense_3", "activity_regularizer": null, "trainable": true, "kernel_initializer": "glorot_normal", "use_bias": true, "input_dim": null, "bias_regularizer": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "activation": "sigmoid", "units": 1}}]}